#ifndef PARAMETERS_INITIAL_H
#define PARAMETERS_INITIAL_H

/*
#define nMaxReadADC			200				// Максимальное количество чтений АЦП для одного канала
#define nWrkReadADC			200				// Количество чтений АЦП для одного канала в штатом режиме
#define nChanlADCd			2					// Число рабочих каналов АЦП. 2,3 - для датчиков; 4,5 - АЭ
#define nDatch					10				// Число датчиков (5+5)
#define nDatchD					5					// Число датчиков давления
#define nDatchT					5					// Число датчиков температуры

#define nMaxBadAE				5					// Число вышедших из строя АЭ, при котором АБ ещё "живёт"
#define nMaxBadDatchD		2					// Число вышедших из строя ДД, при котором АБ ещё "живёт"
#define nMaxBadDatchT		2					// Число вышедших из строя ДТ, при котором АБ ещё "живёт"

#define PMaxDatchD			50				// Максимальное давление для ДД (для автономного управление)
//#define PMaxDatchD			70				// Максимальное давление для ДД (для автономного управление)
#define PMinDatchD			10				// Минимальное давление для ДД (для автономного управление)

#define TMaxDatchT			45				// Максимальное давление для ДД (для автономного управление)
#define TMinDatchT			20				// Минимальное давление для ДД (для автономного управление)

union uBytesFloat16 {
	unsigned char b[2];
	__fp16 Fdata;
};
union uBytesFloat {
	unsigned char b[4];
	float Fdata;
};

//**************************************************************************************************
const float	dTempC[3]	= {4.0, -24.0, -29.0};		// (Грд Цельс) дельта датчика температуры МК

const float kdelta	= 0.05;											// Допустимый диапазон разброса ошибки 5% от диапазона измерений
const float maxAGnd	= 0.1;											// Максимальное значение "общего"

const float Kogr[nChanlADCd] = {1.0, 1.0};			// КОГР – коэффициент ограничения;
												 
			float	AUcc[3]	= {3.269, 3.360, 3.266};		// (В) Опорное напряжение АЦП МУК1, МУК2, МУК3
const float	Uref[3]	= {0.0, 0.0, 0.0};		// (В) Прецизионное напряжение АЦП МУК1, МУК2, МУК3 на PD0

const float Unalad[2]	= {1.691, 1.981};					// (В) Аппаратное напряжение ПСД, МИБ. Для контроля правильной работы АЦП

const float W_rasch = 2900;										  // Расчётная (базовая на начало эксплуатации) разрядная энергия

												 
// .............................................................................................................................
// *** М И Б *******************************************************************************************************************
*/
//const int nCorrectAE 	 = 2;											// Числ пропусков ложного значения напряжений АЭ
//const int koefZadergAE = 4;											// Коэфф задержки после коммутации дешифр АЭ (koefZadergAE*40000)

//float kTempAE[3]	= {0.00000001, 0.00000001, 0.00000001};	// Температурная коррекция АЭ
//float kTempAB[3]	= {0.00000001, 0.00000001, 0.00000001};		// Температурная коррекция АБ

//float minUAE = 0.6;															// (В) Нижняя граница значения рабочего напряжения АЭ
//float maxUAE = 2.0;															// (В) Верхняя граница значения рабочего напряжения АЭ

////													 1		 2			3			 4			5			 6			7			 8			9			10
//const float	kAE_[2][72]	={{ 1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//													  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//													  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//					/* МУК1 */			  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//													  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//					/* МУК1 */			  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0},
//					// ...................................................................................................
////													 1		 2			3			 4			5			 6			7			 8			9			10
//					/* МУК2 */			{ 1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//													  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//													  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//					/* МУК2 */			  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//													  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0,
//					/* МУК2 */			  1.0, 1.0,		1.0, 1.0,   1.0, 1.0,   1.0, 1.0,		1.0, 1.0,		1.0, 1.0}};
//					
//const float	dAE_[2][72]	={{ 0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//														0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//													  0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//					/* МУК1 */			  0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//													  0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//					/* МУК1 */			  0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0},

//					// .................................................................................................
////													 1		 2			3			 4			5			 6			7			 8			9			10
//					/* МУК2 */		  { 0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//														0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//													  0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//					/* МУК2 */			  0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//													  0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,
//					/* МУК2 */			  0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0,		0.0, 0.0}};
//				

//const float	Usm_hrd	=  1.36;										// (В) Аппаратное напряжение средней точкой (смещения)

//const float Unal_AE[3][2] = {{2.488, 2.249},
//														 {2.488, 2.249},
//														 {0.00, 0.00}};			// Коэффициенты коррекции каналов АЦП для АЭ для МУК1, МУК2.

////const float K_AE[3][2] = {{1.093, 0.99},
////													{1.07, 1.05},
////													{0.00, 0.00}};			// Коэффициенты коррекции каналов АЦП для АЭ

//const float kUop[2]	=	{4.325, 4.325};						// Коэфф масштаб для измеренного опорного (аппаратного) напряжения

//float Usm[2] =  {1.349, 1.349};									// (В) Измеренное напряжение средней точкой (смещение)

//float cUsm[3][2] =  {{1.361, 1.363},						// (В) Измеренное напряжение средней точкой (смещение) для МУКов
//									 	 {1.365, 1.359},
//										 {0, 0}};
//float Uop[2] = {1.981, 1.996};									// (В) Измеренное опорное напряжение

//float t_Usm[2]	=	{1.364, 1.36};								// (В) Измеренное напряжение средней точкой (смещение) для отладки
//float t_Uop[2]	=	{2.006, 1.992};

//float TUsm[2];																	// (В) Измеренное напряжение средней точкой (смещение) для отладки
//float TUop[2];																	// (В) Измеренное опорное напряжение для отладки
////
//volatile float NumIzmAE[nDatchD]	= {6, 7, 16, 59, 66};	// 7, 8, 17, 60, 67 - Номера измерительных АЭ (ДД, ДТ) 



//// .............................................................................................................................
//// *** П С Д *******************************************************************************************************************

//const int nCorrectDD = 2;												// Числ пропусков ложного значения напряжений датчиков ДАВЛЕНИЯ
//const int nCorrectDT = 2;												// Числ пропусков ложного значения напряжений датчиков ТЕЧПЕРАТУРЫ

//const int koefZadergDat = 2;										// Коэфф задержки после коммутации дешифр датчиков (koefZadergDat*40000)

//const float	KuAB1[3]	= {1.0, 1.0, 1.0};
//const float	K2uAB1[3]	= {0.0, 0.0, 0.0};
//const float	KuAB2[3]	= {1.0, 1.0, 1.0};
//const float	K2uAB2[3]	= {0.0, 0.0, 0.0};

//// ------------------------------- Датчики давления:

//float ItarD[nDatchD]	= {0.001971,  0.001972,  0.001975, 0.001968, 0.001979};		// (A) Ток опроса датчиков ДД в БЭ
//float IpasD[nDatchD]	= {0.0020,  0.0020,  0.0020, 0.0020, 0.0020};							// (A) Ток опроса датчиков ДД в БЭ

//const float	kDD[3][nDatchD]		= {{1.0, 1.0, 1.0, 1.0, 1.0},
//																 {1.0, 1.0, 1.0, 1.0, 1.0},
//																 {1.0, 1.0, 1.0, 1.0, 1.0}};

//const float	dDD[3][nDatchD]		= {{0.0, 0.0, 0.0, 0.0, 0.0},
//																 {0.0, 0.0, 0.0, 0.0, 0.0},
//																 {0.0, 0.0, 0.0, 0.0, 0.0}};										 

//float a0[3][nDatchD]				  =	{{1.1784,	1.1784, 1.1784, 1.1784, 1.1784},
//														  	 {1.1784,	1.1784, 1.1784, 1.1784, 1.1784},
//	 													  	 {1.1784,	1.1784, 1.1784, 1.1784, 1.1784}};

//float a1[3][nDatchD]				  = {{0.4732, 0.4732, 0.4732, 0.4732, 0.4732},
//	 													  	 {0.4732, 0.4732, 0.4732, 0.4732, 0.4732},
//	 													  	 {0.4732, 0.4732, 0.4732, 0.4732, 0.4732}};

//float a2[3][nDatchD]				  =	{{0.0002, 0.0002, 0.0002, 0.0002, 0.0002},
//	 													  	 {0.0002, 0.0002, 0.0002, 0.0002, 0.0002},
//	 													  	 {0.0002, 0.0002, 0.0002, 0.0002, 0.0002}};
//																 

//// ------------------------------- Датчики температуры:
////const float kTemp = 0.000005;
//const float	kTemp[3][5]	= {0.00000001, 0.00000001, 0.00000001, 0.00000001, 0.00000001,
//													 0.00000001, 0.00000001, 0.00000001, 0.00000001, 0.00000001,
//													 0.00000001, 0.00000001, 0.00000001, 0.00000001, 0.00000001};

//const int	kodADC_t25[3]	= {1700, 1870, 1908};

//const float beginDiap = 0.384;
//																 
//float ItarT[nDatchT]	= {0.00399, 0.003993, 0.0039975, 0.0039725, 0.003996};		// (A) Ток опроса датчиков ДД в БЭ
//float IpasT[nDatchT]	= {0.00399, 0.003993, 0.0039975, 0.0039725, 0.003996};		// (A) Ток опроса датчиков ДД в БЭ

//float R0[nDatchT]			= {99.94, 99.94, 99.94, 99.94, 99.94};										// (ом) Сопротивление датчика при t = 0°C (по паспорту);
//float R100[nDatchT]		= {99.94, 99.94, 99.94, 99.94, 99.94};										// (ом) Сопротивление датчика при t = 100°C (по паспорту);
//												 
//float alpha[nDatchT]	= {0.004149, 0.004149, 0.004149, 0.004149, 0.004149};			// Температурный коэффициент по паспорту.

//const float	kDT[3][nDatchD]		= {{1.0, 1.0, 1.0, 1.0, 1.0},
//																 {1.0, 1.0, 1.0, 1.0, 1.0},
//																 {1.0, 1.0, 1.0, 1.0, 1.0}};

//const float	dDT[3][nDatchD]		= {{0.0, 0.0, 0.0, 0.0, 0.0},
//																 {0.0, 0.0, 0.0, 0.0, 0.0},
//																 {0.0, 0.0, 0.0, 0.0, 0.0}};										 

//const float	dKT[3][nDatchD]	= {{ 0.01,   0.01,  0.010,  0.01,  0.01},
//															 {-0.018, -0.02, -0.018, -0.019, -0.02},
//															 { 0.0245, 0.024, 0.0245, 0.025,  0.024}};						// Коэфф динамической дельты датч темпертуры


#endif
